#+TITLE: DOCKER INTRODUCTION

* Operacoes basicas
** Obtendo o id do ultimo container
   echo $(docker ps -q)

** Listando os container rodando no momento
#+name: var path
#+BEGIN_SRC sh :eval never-exports :var Path=(format "'%s%s'" (file-name-directory (buffer-file-name)) "") :results output replace  :exports both
echo $Path
ls  $($Path)
echo "pwd=" && echo $(pwd)
ls -la
#+END_SRC

#+RESULTS: var path
#+begin_example
'/run/media/wagner/96fea5f1-d297-4f63-a035-abf6511467be/wagnerdocri@gmail.com2/envs/somewritings/docker-introduction/'
pwd=
/home/wagner
total 5356
drwx------.  73 wagner wagner   16384 Jan  5 16:53 .
drwxr-xr-x.   4 root   root      4096 Mai  4  2016 ..
drwx------.   3 wagner wagner    4096 Mai  7  2016 .adobe
drwxrwxr-x.   5 wagner wagner    4096 Mai 16  2016 .android
drwxrwxr-x.   3 wagner wagner    4096 Mai  6  2016 Android
drwxrwxr-x.   4 wagner wagner    4096 Mai  9  2016 .AndroidStudio1.5
drwxrwxr-x.   4 wagner wagner    4096 Mai  6  2016 .AndroidStudio2.1
drwxrwxr-x.   9 wagner wagner    4096 Ago 22 19:52 AndroidStudioProjects
drwxrwxr-x.   3 wagner wagner    4096 Jul 18 00:26 .ApacheDirectoryStudio
drwxr-xr-x.   2 wagner wagner    4096 Jan  1 21:11 Área de trabalho
drwxrwxr-x.   4 wagner wagner    4096 Dez  8 13:02 .audacity-data
-rw-------.   1 wagner wagner   47636 Jan  5 23:27 .bash_history
-rw-r--r--.   1 wagner wagner      18 Ago 18  2015 .bash_logout
-rw-r--r--.   1 wagner wagner     193 Ago 18  2015 .bash_profile
-rw-r--r--.   1 wagner wagner     231 Ago 18  2015 .bashrc
drwx------.   2 wagner wagner   28672 Jan  1 19:35 .bcast
-rw-rw-r--.   1 wagner wagner   20887 Out 30 20:19 bibliografias.rtf
drwx------.  26 wagner wagner    4096 Jan  6 00:24 .cache
drwxrwxr-x.   4 wagner wagner    4096 Dez 30 00:08 .ccache
drwxr-xr-x.  44 wagner wagner    4096 Jan  4 19:30 .config
-rw-rw-r--.   1 wagner wagner    1926 Mai 25  2016 cSharpLinks1~
-rw-rw-r--.   1 wagner wagner   36002 Out 21 01:23 curriculo juçara.pdf
drwx------.   3 wagner wagner    4096 Mai  4  2016 .dbus
-rw-rw-r--.   1 wagner wagner   37097 Dez 15 16:23 declaracaoju.PDF
drwxr-xr-x.   5 wagner wagner    4096 Jul 25 00:13 .dia
-rw-rw-r--.   1 wagner wagner    1558 Jul 25 00:13 Diagrama1.dia~
-rw-rw-r--.   1 wagner wagner     860 Nov 29 08:52 Diagrama2.dia.autosave
-rw-rw-r--.   1 wagner wagner     198 Out  1 13:14 DificuldadesBiblicas.org~
-rw-rw-r--.   1 wagner wagner    5347 Nov 27 18:43 diskManagement.org
-rw-rw-r--.   1 wagner wagner      26 Nov 27 18:20 diskManagement.org~
drwxr-xr-x.   5 wagner wagner    4096 Jan  3 14:59 Downloads
drwxr-xr-x.   4 wagner wagner   12288 Nov 28 00:30 dwhelper
drwxrwxr-x.   6 wagner wagner    4096 Jun  4  2016 .eclipse
drwxrwxr-x.   3 wagner wagner    4096 Out 22 02:12 .elfeed
-rw-rw-r--.   1 wagner wagner     811 Set  2 14:21 .emacs
-rw-rw-r--.   1 wagner wagner     513 Jun 10  2016 .emacs~
drwx------.  11 wagner wagner   12288 Jan  5 23:49 .emacs.d
-rw-------.   1 wagner wagner      16 Mai  4  2016 .esd_auth
drwxrwxr-x.   3 wagner wagner    4096 Dez  4 00:47 .esmtp_queue
-rw-rw-r--.   1 wagner wagner   11683 Set 20 23:11 estatistica-jucara.ods
-rw-rw-r--.   1 wagner wagner       0 Dez 31 14:09 Ex1Diff
-rw-rw-r--.   1 wagner wagner       0 Dez 31 14:08 Ex1Diff.mkv
drwxrwxr-x.   3 wagner wagner    4096 Jul 19 00:12 .eXo
-rw-rw-r--.   1 wagner wagner    8103 Nov 24 19:07 FILME JANELA DA ALMA.docx
-rw-rw-r--.   1 wagner wagner   24622 Nov 24 19:09 FILME JANELA DA ALMA.pdf
drwx------.   3 wagner wagner    4096 Jun 19  2016 .fltk
drwxrwxr-x.   3 wagner wagner    4096 Set 18 15:37 .Genymobile
drwxr-xr-x.  24 wagner wagner    4096 Dez  9 23:00 .gimp-2.8
-rw-rw-r--.   1 wagner wagner      85 Out 17 19:49 .gitconfig
-rw-rw-r--.   1 wagner wagner    8128 Jan  1 22:33 git-introduction.org
drwx------.   3 wagner wagner    4096 Mai  7  2016 .gnome
drwx------.   3 wagner wagner    4096 Nov 15 16:30 .gnome2
drwx------.   2 wagner wagner    4096 Mai  5  2016 .gnome2_private
drwx------.   3 wagner wagner    4096 Ago 22 08:50 .gnupg
drwxrwxr-x.   6 wagner wagner    4096 Set  5 23:55 .gradle
drwxrwxr-x.   2 wagner wagner    4096 Nov 15 12:45 .gstreamer-0.10
-rw-rw-r--.   1 wagner wagner      65 Mai  4  2016 .gtk-bookmarks
-rw-------.   1 wagner wagner    4960 Jan  5 16:53 .ICEauthority
drwxr-xr-x.   2 wagner wagner    4096 Dez 23 21:18 Imagens
-rw-rw-r--.   1 wagner wagner     228 Jul 21 23:27 .install4j
drwxrwxr-x.   3 wagner wagner    4096 Ago 21 22:50 .ireport
drwxrwxr-x.   4 wagner wagner    4096 Mai  9  2016 .java
-rw-rw-r--.   1 wagner wagner     146 Set 21 21:12 js.html~
drwx------.   3 wagner wagner    4096 Ago 28 16:53 .kde
drwxrwxr-x.   6 wagner wagner    4096 Mai 22  2016 kdenliveOld
-rw-rw-r--.   1 wagner wagner   25840 Out 30 22:13 leituraArtigos.org
-rw-rw-r--.   1 wagner wagner   26260 Out 30 22:06 leituraArtigos.org~
-rw-------.   1 wagner wagner      28 Out 17 01:42 .lesshst
drwxrwxr-x.   8 wagner wagner    4096 Ago  4 02:52 .linuxbrew
-rw-rw-r--.   1 wagner wagner    7628 Out  1 12:07 linux_distros.html~
-rw-rw-r--.   1 wagner wagner      22 Out  1 11:41 linux_distros.org~
drwxr-xr-x.   3 wagner wagner    4096 Mai  4  2016 .local
drwxrwxr-x.   3 wagner wagner    4096 Jul 22 01:07 .m2
drwx------.   3 wagner wagner    4096 Mai  7  2016 .macromedia
drwxrwxr-x.   6 wagner wagner    4096 Dez 19 22:58 Mango
drwxrwxr-x.   4 wagner wagner    4096 Mai  4  2016 .mozilla
drwxr-xr-x.   2 wagner wagner    4096 Dez  3 22:29 Música
drwx------.   3 wagner wagner    4096 Jul 24 23:26 .mysql
-rw-------.   1 wagner wagner    1004 Set 19 08:51 .mysql_history
drwxrwxr-x.   3 wagner wagner    4096 Ago 21 22:18 .netbeans
drwxrwxr-x. 306 wagner wagner   16384 Nov  1 22:54 .npm
drwxrwxr-x.   2 wagner wagner    4096 Dez  1 08:16 .openshift
drwxrwxr-x.   9 wagner wagner    4096 Mai 29  2016 .openshot_qt
drwxrwxr-x.   2 wagner wagner    4096 Out 30 19:32 .oracle_jre_usage
drwxrwxr-x.   3 wagner wagner    4096 Nov  4 23:02 .p2
drwxrw----.   3 wagner wagner    4096 Mai  8  2016 .pki
drwxrwxr-x.   2 wagner wagner    4096 Dez  4 02:32 PODCASTS
-rw-rw-r--.   1 wagner wagner 3828085 Nov 30 22:17 praticaemgestao4.pdf.pdf
-rw-rw-r--.   1 wagner wagner   22644 Nov 27 21:30 process-img.org
-rw-rw-r--.   1 wagner wagner     215 Nov 27 15:31 process-img.org~
drwxrwxr-x.   3 wagner wagner    4096 Dez 28 20:47 PROGSATIVOS
-rw-rw-r--.   1 wagner wagner   16189 Set  4 22:20 pspp.jnl
drwxr-xr-x.   3 wagner wagner    4096 Ago 21 08:18 Público
drwxrwxr-x.   3 wagner wagner    4096 Ago  4 13:26 R
-rw-rw-r--.   1 wagner wagner   17629 Set 17 23:05 .RData
-rw-rw-r--.   1 wagner wagner    2227 Set 12 19:12 .recently-used
-rw-rw-r--.   1 wagner wagner     548 Nov 27 18:07 resizentfs.org
-rw-rw-r--.   1 wagner wagner     140 Nov 27 18:03 resizentfs.org~
-rw-rw-r--.   1 wagner wagner   26099 Set 20 22:59 RespostaEstatisticaJucara.odt
-rw-rw-r--.   1 wagner wagner    1857 Set 17 23:05 .Rhistory
drwxrwxr-x.  14 wagner wagner    4096 Set 17 23:05 .rstudio-desktop
drwxrwx---.   3 wagner wagner    4096 Jun  9  2016 .sane
-rw-rw-r--.   1 wagner wagner       3 Out  1 14:59 SobreEducao.org~
-rw-rw-r--.   1 wagner wagner  150216 Jul 21 16:48 sofacomprarealizada.png
drwx------.   2 wagner wagner    4096 Mai 15  2016 .ssh
drwxrwxr-x.   3 wagner wagner    4096 Mai  4  2016 .subversion
drwxrwxr-x.   2 wagner wagner    4096 Jul 18 00:35 .swt
-rw-rw-r--.   1 wagner wagner  195867 Out 30 18:54 tccwagner2FinalNoEmacs.org
lrwxrwxrwx.   1 wagner wagner      44 Out 30 20:52 .#tccwagner2.org -> wagner@localhost.localdomain.6876:1477843328
-rwxrwxrwx.   1 wagner wagner  190726 Out 30 17:46 tccwagner2.org
-rwxrwxrwx.   1 wagner wagner   17012 Out 30 20:33 tccwagner.bib
-rw-rw-r--.   1 wagner wagner   17012 Out 30 20:33 tccwagner.bib.bak
-rw-rw-r--.   1 wagner wagner    4004 Nov 11 00:56 temoPosUnifespWiki.org
-rw-rw-r--.   1 wagner wagner     779 Nov 11 00:02 temoPosUnifespWiki.org~
drwxrwxr-x.   6 wagner wagner    4096 Dez 31 04:31 TEMP
-rw-rw-r--.   1 wagner wagner    1086 Nov  7 14:45 tempc.txt
-rw-rw-r--.   1 wagner wagner     544 Nov  7 14:43 tempc.txt~
-rw-rw-r--.   1 wagner wagner    5519 Ago 14 14:12 temp.txt
-rw-rw-r--.   1 wagner wagner     710 Ago 14 13:31 temp.txt~
-rw-rw-r--.   1 wagner wagner     975 Nov 15 16:20 tempUnifesp.txt
-rw-rw-r--.   1 wagner wagner     324 Nov 15 15:35 tempUnifesp.txt~
-rw-rw-r--.   1 wagner wagner     329 Ago  2 19:00 test.html~
drwx-----T.   3 wagner wagner    4096 Ago 10 16:44 .texlive2014
drwx------.   3 wagner wagner    4096 Mai 16  2016 .thumbnails
drwx------.   4 wagner wagner    4096 Mai  5  2016 .thunderbird
drwxrwxr-x.   3 wagner wagner    4096 Jun 13  2016 .tooling
-rw-rw-r--.   1 wagner wagner    2442 Jun 11  2016 tutlistview~
drwxr-xr-x.   4 wagner wagner    4096 Dez  3 23:20 Vídeos
drwxrwxr-x.   2 wagner wagner    4096 Jul 20 00:21 .vim
drwxrwxr-x.   7 wagner wagner    4096 Dez  6 00:48 VirtualBox VMs
drwxr-xr-x.   2 wagner wagner    4096 Jun 19  2016 .vnc
drwxrwxr-x.  11 wagner wagner    4096 Dez 24 15:29 wagnerdocri@gmail.com2
-rw-rw-r--.   1 wagner wagner   10181 Out 31 01:42 Wagner-Resumo da leitura dos artigos - Etapa 3.docx
-rw-rw-r--.   1 wagner wagner   18168 Out 31 01:41 Wagner-Resumo da leitura dos artigos - Etapa 3.odt
-rw-rw-r--.   1 wagner wagner     391 Out 26 21:43 wagnertcc.bib
-rw-rw-r--.   1 wagner wagner     567 Jul 28 04:30 .wget-hsts
-rw-rw-r--.   1 wagner wagner   22478 Jan  5 23:27 .xfce4-session.verbose-log
-rw-rw-r--.   1 wagner wagner   23611 Jan  5 01:56 .xfce4-session.verbose-log.last
-rw-rw-r--.   1 wagner wagner    8325 Set 19 02:27 .xscreensaver
-rw-------.   1 wagner wagner    1167 Jan  5 23:27 .xsession-errors
-rw-------.   1 wagner wagner    2363 Jan  5 01:56 .xsession-errors.old
drwx------.   3 wagner wagner    4096 Nov 14 11:08 .zotero
#+end_example


#+name: var path2 buffer-file-name
#+BEGIN_SRC sh :eval never-exports :var Path=(file-name-directory (buffer-file-name)) :results output replace  :exports both
echo $Path
ls -la $($Path)
#+END_SRC

#+RESULTS: var path2 buffer-file-name
: /run/media/wagner/96fea5f1-d297-4f63-a035-abf6511467be/wagnerdocri@gmail.com2/envs/somewritings/docker-introduction/
: total 12
: drwxrwxr-x. 2 wagner wagner 4096 Jan  6 00:05 .
: drwxrwxrwx. 9 wagner wagner 4096 Jan  5 23:42 ..
: -rw-rw-r--. 1 wagner wagner 1517 Jan  6 00:05 docker-introduction.org

#+RESULTS: var path2
: /run/media/wagner/96fea5f1-d297-4f63-a035-abf6511467be/wagnerdocri@gmail.com2/envs/somewritings/docker-introduction/
: total 12
: drwxrwxr-x. 2 wagner wagner 4096 Jan  6 00:02 .
: drwxrwxrwx. 9 wagner wagner 4096 Jan  5 23:42 ..
: -rw-rw-r--. 1 wagner wagner 1000 Jan  6 00:02 docker-introduction.org


#+RESULTS: docker -ps
: total 12
: drwxrwxr-x. 2 wagner wagner 4096 Jan  6 00:00 .
: drwxrwxrwx. 9 wagner wagner 4096 Jan  5 23:42 ..
: -rw-rw-r--. 1 wagner wagner  435 Jan  6 00:00 docker-introduction.org


#+BEGIN_SRC sh :name 1 :output both
docker ps
#+END_SRC

#+RESULTS:


#+BEGIN_SRC sh
#+END_SRC

#+BEGIN_SRC sh
#+END_SRC

#+BEGIN_SRC sh
#+END_SRC


** docker volume ls
   https://docs.docker.com/engine/reference/commandline/volume_ls/
   
*** docker volume ls -f dangling=true
    Lista volumes que nao estao sendo referenciados por nenhum container
    
*** docker volume ls -f name=R
    Filtra a listagem de volumes com uma regra tipo like %R%

*** docker volume ls --format "{{.Name}}: {{.Driver}}"
    https://docs.docker.com/engine/reference/commandline/volume_ls/#formatting
    
    
***  Obter o ip do container
    docker inspect --format '{{ .NetworkSettings.IPAddress }}' $(docker ps -q)


* docker network
sudo docker network create \
    --driver bridge \
    --subnet=192.168.33.0/24 \
    --gateway=192.168.33.10 \
    --opt "com.docker.network.bridge.name"="docker1" \
    shared_nw

